In [1]:
import pandas as pd

In [7]:
cars = pd.read_csv('d:/data/usedcars.csv')

In [8]:
cars.ndim,cars.shape

(2, (150, 6))

In [9]:
cars.dtypes

year             int64
model           object
price            int64
mileage          int64
color           object
transmission    object
dtype: object

In [10]:
cars.columns

Index(['year', 'model', 'price', 'mileage', 'color', 'transmission'], dtype='object')

In [12]:
cars.

Index            132
year            1200
model           1200
price           1200
mileage         1200
color           1200
transmission    1200
dtype: int64

In [17]:
cars.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [18]:
cars.tail()

     year model  price  mileage   color transmission
145  2006   SES   6200    95000  Silver         AUTO
146  2002    SE   5995    87003     Red         AUTO
147  2000    SE   5980    96841     Red         AUTO
148  2001    SE   4899   151479  Yellow         AUTO
149  2000    SE   3800   109259     Red         AUTO

In [19]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          150 non-null    int64
 1   model         150 non-null    object
 2   price         150 non-null    int64
 3   mileage       150 non-null    int64
 4   color         150 non-null    object
 5   transmission  150 non-null    object
dtypes: int64(3), object(3)
memory usage: 7.2+ KB

In [22]:
cars.memory_usage()

Index            132
year            1200
model           1200
price           1200
mileage         1200
color           1200
transmission    1200
dtype: int64

In [23]:
insurance = pd.read_csv('d:/data/insurance.csv')
insurance.shape

(1338, 7)

In [24]:
insurance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   gender    1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [25]:
insurance.head()

   age  gender     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [26]:
insurance.tail()

      age  gender    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [27]:
snsdata = pd.read_csv('d:/data/snsdata.csv')
snsdata.shape

(30000, 40)

In [28]:
snsdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 40 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   gradyear      30000 non-null  int64
 1   gender        27276 non-null  object
 2   age           24913 non-null  float64
 3   friends       30000 non-null  int64
 4   basketball    30000 non-null  int64
 5   football      30000 non-null  int64
 6   soccer        30000 non-null  int64
 7   softball      30000 non-null  int64
 8   volleyball    30000 non-null  int64
 9   swimming      30000 non-null  int64
 10  cheerleading  30000 non-null  int64
 11  baseball      30000 non-null  int64
 12  tennis        30000 non-null  int64
 13  sports        30000 non-null  int64
 14  cute          30000 non-null  int64
 15  sex           30000 non-null  int64
 16  sexy          30000 non-null  int64
 17  hot           30000 non-null  int64
 18  kissed        30000 non-null  int64
 19  dance         30000 non-null  int64
 20  band          30000 non-null  int64
 21  marching      30000 non-null  int64
 22  music         30000 non-null  int64
 23  rock          30000 non-null  int64
 24  god           30000 non-null  int64
 25  church        30000 non-null  int64
 26  jesus         30000 non-null  int64
 27  bible         30000 non-null  int64
 28  hair          30000 non-null  int64
 29  dress         30000 non-null  int64
 30  blonde        30000 non-null  int64
 31  mall          30000 non-null  int64
 32  shopping      30000 non-null  int64
 33  clothes       30000 non-null  int64
 34  hollister     30000 non-null  int64
 35  abercrombie   30000 non-null  int64
 36  die           30000 non-null  int64
 37  death         30000 non-null  int64
 38  drunk         30000 non-null  int64
 39  drugs         30000 non-null  int64
dtypes: float64(1), int64(38), object(1)
memory usage: 9.2+ MB

In [44]:
snsdata.head()

,gradyear,gender,age,friends,basketball,football,soccer,softball,volleyball,swimming,...,blonde,mall,shopping,clothes,hollister,abercrombie,die,death,drunk,drugs
0,2006,M,NaN,7,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2006,F,18.801,0,0,1,0,0,0,0,...,0,1,0,0,0,0,0,0,0,0
2,2006,M,18.335,69,0,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,2006,F,18.875,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,2006,NaN,18.995,10,0,0,0,0,0,0,...,0,0,2,0,0,0,0,0,1,1

In [48]:
snsdata.head(n=10).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 40 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   gradyear      10 non-null     int64
 1   gender        9 non-null      object
 2   age           8 non-null      float64
 3   friends       10 non-null     int64
 4   basketball    10 non-null     int64
 5   football      10 non-null     int64
 6   soccer        10 non-null     int64
 7   softball      10 non-null     int64
 8   volleyball    10 non-null     int64
 9   swimming      10 non-null     int64
 10  cheerleading  10 non-null     int64
 11  baseball      10 non-null     int64
 12  tennis        10 non-null     int64
 13  sports        10 non-null     int64
 14  cute          10 non-null     int64
 15  sex           10 non-null     int64
 16  sexy          10 non-null     int64
 17  hot           10 non-null     int64
 18  kissed        10 non-null     int64
 19  dance         10 non-null     int64
 20  band          10 non-null     int64
 21  marching      10 non-null     int64
 22  music         10 non-null     int64
 23  rock          10 non-null     int64
 24  god           10 non-null     int64
 25  church        10 non-null     int64
 26  jesus         10 non-null     int64
 27  bible         10 non-null     int64
 28  hair          10 non-null     int64
 29  dress         10 non-null     int64
 30  blonde        10 non-null     int64
 31  mall          10 non-null     int64
 32  shopping      10 non-null     int64
 33  clothes       10 non-null     int64
 34  hollister     10 non-null     int64
 35  abercrombie   10 non-null     int64
 36  die           10 non-null     int64
 37  death         10 non-null     int64
 38  drunk         10 non-null     int64
 39  drugs         10 non-null     int64
dtypes: float64(1), int64(38), object(1)
memory usage: 3.3+ KB

In [51]:
df1 = pd.read_excel('e:/data/AdventureWorks2017.xlsx',sheet_name=['DimProduct','DimDate'])
df1['DimProduct'].shape

(606, 10)

In [55]:
df1['DimDate'].shape

(3652, 15)

In [31]:
data = pd.read_excel('d:/data/AdventureWorks2017.xlsx',sheet_name=None)

dict

In [33]:
data.keys()

dict_keys(['DimProductCategory', 'DimProduct', 'DimDate', 'DimProductSubcategory', 'DimGeography', 'FactInternetSales'])

In [35]:
data['DimProductCategory'].shape

(4, 3)

In [39]:
data['FactInternetSales'].head()

,ProductKey,OrderDateKey,DueDateKey,ShipDateKey,CustomerKey,PromotionKey,CurrencyKey,SalesTerritoryKey,SalesOrderNumber,SalesOrderLineNumber,...,ProductStandardCost,TotalProductCost,SalesAmount,TaxAmt,Freight,CarrierTrackingNumber,CustomerPONumber,OrderDate,DueDate,ShipDate
0,310,20101229,20110110,20110105,21768,1,19,6,SO43697,1,...,2171.2942,2171.2942,3578.2700,286.2616,89.4568,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
1,310,20101229,20110110,20110105,21768,1,19,6,SO43697,1,...,2171.2942,2171.2942,3578.2700,286.2616,89.4568,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
2,346,20101229,20110110,20110105,28389,1,39,7,SO43698,1,...,1912.1544,1912.1544,3399.9900,271.9992,84.9998,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
3,346,20101229,20110110,20110105,25863,1,100,1,SO43699,1,...,1912.1544,1912.1544,3399.9900,271.9992,84.9998,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
4,336,20101229,20110110,20110105,14501,1,100,4,SO43700,1,...,413.1463,413.1463,699.0982,55.9279,17.4775,NaN,NaN,2010-12-29,2011-01-10,2011-01-05

In [42]:
data['DimDate'].shape

(3652, 15)

In [43]:
data['FactInternetSales'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60399 entries, 0 to 60398
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             60399 non-null  int64
 1   OrderDateKey           60399 non-null  int64
 2   DueDateKey             60399 non-null  int64
 3   ShipDateKey            60399 non-null  int64
 4   CustomerKey            60399 non-null  int64
 5   PromotionKey           60399 non-null  int64
 6   CurrencyKey            60399 non-null  int64
 7   SalesTerritoryKey      60399 non-null  int64
 8   SalesOrderNumber       60399 non-null  object
 9   SalesOrderLineNumber   60399 non-null  int64
 10  RevisionNumber         60399 non-null  int64
 11  OrderQuantity          60399 non-null  int64
 12  UnitPrice              60399 non-null  float64
 13  ExtendedAmount         60399 non-null  float64
 14  UnitPriceDiscountPct   60399 non-null  int64
 15  DiscountAmount         60399 non-null  object
 16  ProductStandardCost    60399 non-null  float64
 17  TotalProductCost       60399 non-null  float64
 18  SalesAmount            60399 non-null  float64
 19  TaxAmt                 60399 non-null  float64
 20  Freight                60399 non-null  float64
 21  CarrierTrackingNumber  0 non-null      float64
 22  CustomerPONumber       0 non-null      float64
 23  OrderDate              59341 non-null  datetime64[ns]
 24  DueDate                59341 non-null  datetime64[ns]
 25  ShipDate               59341 non-null  datetime64[ns]
dtypes: datetime64[ns](3), float64(9), int64(12), object(2)
memory usage: 12.0+ MB